onvif/gsoap/cpp/MediaBinding.SetMetadataConfiguration.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
  xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
  xmlns:wsdd="http://schemas.xmlsoap.org/ws/2005/04/discovery"
  xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex"
  xmlns:wsa5="http://www.w3.org/2005/08/addressing"
  xmlns:ns3="http://www.onvif.org/ver10/pacs"
  xmlns:xmime="http://tempuri.org/xmime.xsd"
  xmlns:xop="http://www.w3.org/2004/08/xop/include"
  xmlns:tt="http://www.onvif.org/ver10/schema"
  xmlns:wsrfbf="http://docs.oasis-open.org/wsrf/bf-2"
  xmlns:wstop="http://docs.oasis-open.org/wsn/t-1"
  xmlns:wsrfr="http://docs.oasis-open.org/wsrf/r-2"
  xmlns:ns1="http://www.onvif.org/ver10/actionengine/wsdl"
  xmlns:ns2="http://www.onvif.org/ver10/accesscontrol/wsdl"
  xmlns:ns4="http://www.onvif.org/ver10/doorcontrol/wsdl"
  xmlns:tad="http://www.onvif.org/ver10/analyticsdevice/wsdl"
  xmlns:tan="http://www.onvif.org/ver20/analytics/wsdl"
  xmlns:tdn="http://www.onvif.org/ver10/network/wsdl"
  xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
  xmlns:tev="http://www.onvif.org/ver10/events/wsdl"
  xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
  xmlns:timg="http://www.onvif.org/ver20/imaging/wsdl"
  xmlns:tls="http://www.onvif.org/ver10/display/wsdl"
  xmlns:tmd="http://www.onvif.org/ver10/deviceIO/wsdl"
  xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl"
  xmlns:trc="http://www.onvif.org/ver10/recording/wsdl"
  xmlns:trp="http://www.onvif.org/ver10/replay/wsdl"
  xmlns:trt="http://www.onvif.org/ver10/media/wsdl"
  xmlns:trv="http://www.onvif.org/ver10/receiver/wsdl"
  xmlns:tse="http://www.onvif.org/ver10/search/wsdl">
 <SOAP-ENV:Header>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <trt:SetMetadataConfiguration>
    <trt:Configuration token="">
     <tt:PTZStatus>
      <tt:Status>false</tt:Status>
      <tt:Position>false</tt:Position>
      <!-- extensibility element(s) -->

     </tt:PTZStatus>
     <tt:Events>
      <tt:Filter>
       <!-- extensibility element(s) -->

       <!-- extensibility element(s) -->

       <!-- extensibility element(s) -->

      </tt:Filter>
      <tt:SubscriptionPolicy>
       <!-- extensibility element(s) -->

       <!-- extensibility element(s) -->

      </tt:SubscriptionPolicy>
      <!-- extensibility element(s) -->

      <!-- extensibility element(s) -->

      <!-- extensibility element(s) -->

     </tt:Events>
     <tt:Analytics>false</tt:Analytics>
     <tt:Multicast>
      <tt:Address>
       <tt:Type>IPv4</tt:Type>
       <tt:IPv4Address></tt:IPv4Address>
       <tt:IPv6Address></tt:IPv6Address>
       <!-- extensibility element(s) -->

      </tt:Address>
      <tt:Port>0</tt:Port>
      <tt:TTL>0</tt:TTL>
      <tt:AutoStart>false</tt:AutoStart>
      <!-- extensibility element(s) -->

      <!-- extensibility element(s) -->

      <!-- extensibility element(s) -->

     </tt:Multicast>
     <tt:SessionTimeout>PT0S</tt:SessionTimeout>
     <!-- extensibility element(s) -->

     <!-- extensibility element(s) -->

     <tt:AnalyticsEngineConfiguration>
      <tt:AnalyticsModule>
       <tt:Parameters>
        <!-- extensibility element(s) -->

       </tt:Parameters>
       <!-- extensibility element(s) -->

      </tt:AnalyticsModule>
      <tt:AnalyticsModule>
       <tt:Parameters>
        <!-- extensibility element(s) -->

       </tt:Parameters>
       <!-- extensibility element(s) -->

      </tt:AnalyticsModule>
      <tt:Extension>
       <!-- extensibility element(s) -->

       <!-- extensibility element(s) -->

       <!-- extensibility element(s) -->

      </tt:Extension>
      <!-- extensibility element(s) -->

     </tt:AnalyticsEngineConfiguration>
     <tt:Extension>
      <!-- extensibility element(s) -->

      <!-- extensibility element(s) -->

      <!-- extensibility element(s) -->

     </tt:Extension>
     <tt:Name></tt:Name>
     <tt:UseCount>0</tt:UseCount>
     <!-- extensibility element(s) -->

    </trt:Configuration>
    <trt:ForcePersistence>false</trt:ForcePersistence>
   </trt:SetMetadataConfiguration>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
